//Завдання 3. Написати функцію для обчислення похідної від різних
//функцій з використанням вказівника на функцію в якості одного з
//аргументів цієї функції. (Лекція 2). Протестувати роботу функції на
//прикладах декількох різних (не тільки примітивних )функцій.
#include "lib.h"


int main() {
    double x;
    double dx = 0.00001;
    printf("Введите число: ");
    scanf("%lf", &x);

    printf("Производная f(x) = x^2 в точке %lf: %lf\n", x, poh(x, dx, square_function));
    printf("Производная f(x) = sin(x) в точке %lf: %lf\n", x, poh(x, dx, sin_function));
    printf("Производная f(x) = e^x в точке %lf: %lf\n", x, poh(x, dx, exp_function));
    printf("Производная f(x) = x^3 - 2x^2 + 3x - 5 в точке %lf: %lf\n", x, poh(x, dx, polynom));

    return 0;
}